Catalogs/АК_ОтчетыПоДаннымВнешнихИсточников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>АК_ОтчетыПоДаннымВнешнихИсточников</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОписаниеИсточникаДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяБазаДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АК_ВнешниеБазыДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВариантыНастроек</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/АК_ОтчетыПоДаннымВнешнихИсточников/Ext/ObjectModule.bsl
//
Процедура ПередЗаписью(Отказ)
	
	//
	Структура = Новый Структура("СводнаяТаблица, ТаблицаВыбранныхПолей"); 
	ЗаполнитьЗначенияСвойств(Структура, ДополнительныеСвойства);
	
	//
	ОписаниеИсточникаДанных = Новый ХранилищеЗначения(Структура);
	
	//
	Если ДополнительныеСвойства.Свойство("НастройкиСКД") Тогда
		
		//
		Для Каждого СтрокаТЧ Из ВариантыНастроек Цикл
			
			//
			ИмяНастройки = "Настройка" + Формат(СтрокаТЧ.ID, "ЧН=0; ЧГ=");
			
			//
			Если ДополнительныеСвойства.НастройкиСКД.Свойство(ИмяНастройки) Тогда
				СтрокаТЧ.Настройка = Новый ХранилищеЗначения(ДополнительныеСвойства.НастройкиСКД[ИмяНастройки]);
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры

//
Если ЗначениеЗаполнено(Ссылка) Тогда

	//
	Структура = Ссылка.ОписаниеИсточникаДанных.Получить();
	Если ЗначениеЗаполнено(Структура) Тогда

		//
		ДополнительныеСвойства.Вставить("СводнаяТаблица", Структура.СводнаяТаблица);
		ДополнительныеСвойства.Вставить("ТаблицаВыбранныхПолей", Структура.ТаблицаВыбранныхПолей);
		
	КонецЕсли;

	//
	Структура = Новый Структура;
	Для Каждого СтрокаТЧ Из Ссылка.ВариантыНастроек Цикл
		
		//
		Структура.Вставить("Настройка" + Формат(СтрокаТЧ.ID, "ЧН=0; ЧГ="), СтрокаТЧ.Настройка.Получить());
		
	КонецЦикла;	

	//
	ДополнительныеСвойства.Вставить("НастройкиСКД", Структура);
	
КонецЕсли;
